{"likes": [{"id": 120, "title": "The Lord of the Rings: The Fellowship of the Ring", "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.", "vote_average": 8.402, "runtime": 179, "poster_path": "https://image.tmdb.org/t/p/w500/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg", "cast": "Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Ian Holm", "director": "Peter Jackson", "release_date": "2001-12-18"}, {"id": 122, "title": "The Lord of the Rings: The Return of the King", "overview": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the ring closer to the heart of Mordor, the dark lord's realm.", "vote_average": 8.474, "runtime": 201, "poster_path": "https://image.tmdb.org/t/p/w500/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg", "cast": "Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Andy Serkis", "director": "Peter Jackson", "release_date": "2003-12-01"}, {"id": 27205, "title": "Inception", "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.", "vote_average": 8.364, "runtime": 148, "poster_path": "https://image.tmdb.org/t/p/w500/oYuLEt3zVCKq57qu2F8dT7NIa6f.jpg", "cast": "Leonardo DiCaprio, Joseph Gordon-Levitt, Ken Watanabe, Tom Hardy, Elliot Page", "director": "Christopher Nolan", "release_date": "2010-07-15"}, {"id": 550, "title": "Fight Club", "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.", "vote_average": 8.438, "runtime": 139, "poster_path": "https://image.tmdb.org/t/p/w500/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg", "cast": "Edward Norton, Brad Pitt, Helena Bonham Carter, Meat Loaf, Jared Leto", "director": "David Fincher", "release_date": "1999-10-15"}, {"id": 13, "title": "Forrest Gump", "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.", "vote_average": 8.477, "runtime": 142, "poster_path": "https://image.tmdb.org/t/p/w500/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg", "cast": "Tom Hanks, Robin Wright, Gary Sinise, Sally Field, Mykelti Williamson", "director": "Robert Zemeckis", "release_date": "1994-06-23"}, {"id": 157336, "title": "Interstellar", "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.", "vote_average": 8.417, "runtime": 169, "poster_path": "https://image.tmdb.org/t/p/w500/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg", "cast": "Matthew McConaughey, Anne Hathaway, Michael Caine, Jessica Chastain, Casey Affleck", "director": "Christopher Nolan", "release_date": "2014-11-05"}, {"id": 680, "title": "Pulp Fiction", "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.", "vote_average": 8.488, "runtime": 154, "poster_path": "https://image.tmdb.org/t/p/w500/d5iIlFn5s0ImszYzBPb8JPIfbXD.jpg", "cast": "John Travolta, Samuel L. Jackson, Uma Thurman, Bruce Willis, Ving Rhames", "director": "Quentin Tarantino", "release_date": "1994-09-10"}, {"id": 155, "title": "The Dark Knight", "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.", "vote_average": 8.512, "runtime": 152, "poster_path": "https://image.tmdb.org/t/p/w500/qJ2tW6WMUDux911r6m7haRef0WH.jpg", "cast": "Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal", "director": "Christopher Nolan", "release_date": "2008-07-16"}, {"id": 238, "title": "The Godfather", "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.", "vote_average": 8.707, "runtime": 175, "poster_path": "https://image.tmdb.org/t/p/w500/3bhkrj58Vtu7enYsRolD1fZdja1.jpg", "cast": "Marlon Brando, Al Pacino, James Caan, Robert Duvall, Richard S. Castellano", "director": "Francis Ford Coppola", "release_date": "1972-03-14"}, {"id": 278, "title": "The Shawshank Redemption", "overview": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.", "vote_average": 8.702, "runtime": 142, "poster_path": "https://image.tmdb.org/t/p/w500/lyQBXzOQSuE59IsHyhrp0qIiPAz.jpg", "cast": "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler, Clancy Brown", "director": "Frank Darabont", "release_date": "1994-09-23"}, {"id": 13223, "title": "Gran Torino", "overview": "Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.", "vote_average": 7.994, "runtime": 116, "poster_path": "https://image.tmdb.org/t/p/w500/zUybYvxWdAJy5hhYovsXtHSWI1l.jpg", "cast": "Clint Eastwood, Christopher Carley, Bee Vang, Ahney Her, Brian Haley", "director": "Clint Eastwood", "release_date": "2008-12-12"}, {"id": 334543, "title": "Lion", "overview": "A five-year-old Indian boy gets lost on the streets of Calcutta, thousands of kilometers from home. He survives many challenges before being adopted by a couple in Australia; 25 years later, he sets out to find his lost family.", "vote_average": 8.083, "runtime": 118, "poster_path": "https://image.tmdb.org/t/p/w500/iBGRbLvg6kVc7wbS8wDdVHq6otm.jpg", "cast": "Dev Patel, Rooney Mara, David Wenham, Nicole Kidman, Abhishek Bharate", "director": "Garth Davis", "release_date": "2016-11-24"}, {"id": 14, "title": "American Beauty", "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.", "vote_average": 8, "runtime": 122, "poster_path": "https://image.tmdb.org/t/p/w500/wby9315QzVKdW9BonAefg8jGTTb.jpg", "cast": "Kevin Spacey, Annette Bening, Thora Birch, Wes Bentley, Mena Suvari", "director": "Sam Mendes", "release_date": "1999-09-15"}, {"id": 489, "title": "Good Will Hunting", "overview": "Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he solves a difficult graduate-level math problem, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he will get treatment from therapist Sean Maguire.", "vote_average": 8.149, "runtime": 127, "poster_path": "https://image.tmdb.org/t/p/w500/bABCBKYBK7A5G1x0FzoeoNfuj2.jpg", "cast": "Matt Damon, Robin Williams, Ben Affleck, Stellan Skarsgård, Minnie Driver", "director": "Gus Van Sant", "release_date": "1997-12-05"}, {"id": 240, "title": "The Godfather Part II", "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.", "vote_average": 8.591, "runtime": 202, "poster_path": "https://image.tmdb.org/t/p/w500/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg", "cast": "Al Pacino, Robert Duvall, Diane Keaton, Robert De Niro, John Cazale", "director": "Francis Ford Coppola", "release_date": "1974-12-20"}, {"id": 207, "title": "Dead Poets Society", "overview": "At an elite, old-fashioned boarding school in New England, a passionate English teacher inspires his students to rebel against convention and seize the potential of every day, courting the disdain of the stern headmaster.", "vote_average": 8.312, "runtime": 128, "poster_path": "https://image.tmdb.org/t/p/w500/ai40gM7SUaGA6fthvsd87o8IQq4.jpg", "cast": "Robin Williams, Robert Sean Leonard, Ethan Hawke, Josh Charles, Gale Hansen", "director": "Peter Weir", "release_date": "1989-06-02"}, {"id": 389, "title": "12 Angry Men", "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.", "vote_average": 8.54, "runtime": 97, "poster_path": "https://image.tmdb.org/t/p/w500/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg", "cast": "Martin Balsam, John Fiedler, Lee J. Cobb, E.G. Marshall, Jack Klugman", "director": "Sidney Lumet", "release_date": "1957-04-10"}, {"id": 510, "title": "One Flew Over the Cuckoo's Nest", "overview": "A petty criminal fakes insanity to serve his sentence in a mental ward rather than prison. He soon finds himself as a leader to the other patients—and an enemy to the cruel, domineering nurse who runs the ward.", "vote_average": 8.42, "runtime": 133, "poster_path": "https://image.tmdb.org/t/p/w500/3jcbDmRFiQ83drXNOvRDeKHxS0C.jpg", "cast": "Jack Nicholson, Brad Dourif, Louise Fletcher, Danny DeVito, William Redfield", "director": "Miloš Forman", "release_date": "1975-11-19"}, {"id": 73, "title": "American History X", "overview": "Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.", "vote_average": 8.352, "runtime": 119, "poster_path": "https://image.tmdb.org/t/p/w500/euypWkaYFOLW3e5rLIcTAjWnhhT.jpg", "cast": "Edward Norton, Edward Furlong, Beverly D'Angelo, Jennifer Lien, Ethan Suplee", "director": "Tony Kaye", "release_date": "1998-07-01"}, {"id": 235, "title": "Stand by Me", "overview": "Gordie, Chris, Teddy and Vern are four friends who decide to hike to find the corpse of Ray Brower, a local teenager, who was hit by a train while plucking blueberries in the wild.", "vote_average": 7.856, "runtime": 89, "poster_path": "https://image.tmdb.org/t/p/w500/vz0w9BSehcqjDcJOjRaCk7fgJe7.jpg", "cast": "Wil Wheaton, River Phoenix, Corey Feldman, Jerry O'Connell, Kiefer Sutherland", "director": "Rob Reiner", "release_date": "1986-08-08"}, {"id": 524, "title": "Casino", "overview": "In early-1970s Las Vegas, Sam \"Ace\" Rothstein gets tapped by his bosses to head the Tangiers Casino. At first, he's a great success in the job, but over the years, problems with his loose-cannon enforcer Nicky Santoro, his ex-hustler wife Ginger, her con-artist ex Lester Diamond and a handful of corrupt politicians put Sam in ever-increasing danger.", "vote_average": 8.004, "runtime": 179, "poster_path": "https://image.tmdb.org/t/p/w500/6zEZY1htzRos2w0W3T7o7W1WJhp.jpg", "cast": "Robert De Niro, Sharon Stone, Joe Pesci, James Woods, Don Rickles", "director": "Martin Scorsese", "release_date": "1995-11-22"}, {"id": 627, "title": "Trainspotting", "overview": "Heroin addict Mark Renton stumbles through bad ideas and sobriety attempts with his unreliable friends -- Sick Boy, Begbie, Spud and Tommy. He also has an underage girlfriend, Diane, along for the ride. After cleaning up and moving from Edinburgh to London, Mark finds he can't escape the life he left behind when Begbie shows up at his front door on the lam, and a scheming Sick Boy follows.", "vote_average": 8, "runtime": 94, "poster_path": "https://image.tmdb.org/t/p/w500/bhY62Dw8iW54DIhxPQerbuB9DOP.jpg", "cast": "Ewan McGregor, Ewen Bremner, Jonny Lee Miller, Kevin McKidd, Robert Carlyle", "director": "Danny Boyle", "release_date": "1996-02-23"}, {"id": 640, "title": "Catch Me If You Can", "overview": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.", "vote_average": 7.971, "runtime": 141, "poster_path": "https://image.tmdb.org/t/p/w500/ctjEj2xM32OvBXCq8zAdK3ZrsAj.jpg", "cast": "Leonardo DiCaprio, Tom Hanks, Christopher Walken, Martin Sheen, Nathalie Baye", "director": "Steven Spielberg", "release_date": "2002-12-16"}, {"id": 103, "title": "Taxi Driver", "overview": "A mentally unstable Vietnam War veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feed his urge for violent action.", "vote_average": 8.2, "runtime": 114, "poster_path": "https://image.tmdb.org/t/p/w500/ekstpH614fwDX8DUln1a2Opz0N8.jpg", "cast": "Robert De Niro, Jodie Foster, Cybill Shepherd, Harvey Keitel, Peter Boyle", "director": "Martin Scorsese", "release_date": "1976-02-09"}, {"id": 769, "title": "GoodFellas", "overview": "The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.", "vote_average": 8.464, "runtime": 145, "poster_path": "https://image.tmdb.org/t/p/w500/aKuFiU82s5ISJpGZp7YkIr3kCUd.jpg", "cast": "Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco, Paul Sorvino", "director": "Martin Scorsese", "release_date": "1990-09-12"}, {"id": 334541, "title": "Manchester by the Sea", "overview": "After his older brother passes away, Lee Chandler is forced to return home to care for his 16-year-old nephew. There he is compelled to deal with a tragic past that separated him from his family and the community where he was born and raised.", "vote_average": 7.5, "runtime": 138, "poster_path": "https://image.tmdb.org/t/p/w500/e8daDzP0vFOnGyKmve95Yv0D0io.jpg", "cast": "Casey Affleck, Lucas Hedges, Michelle Williams, Kyle Chandler, C.J. Wilson", "director": "Kenneth Lonergan", "release_date": "2016-11-18"}, {"id": 306819, "title": "The Danish Girl", "overview": "When Gerda Wegener asks her husband Einar to fill in as a portrait model, Einar discovers the person she's meant to be and begins living her life as Lili Elbe. Having realized her true self and with Gerda's love and support, Lili embarks on a groundbreaking journey as a transgender pioneer.", "vote_average": 7.605, "runtime": 119, "poster_path": "https://image.tmdb.org/t/p/w500/mXZZIacI5FC8thzSC0lgQBQ2uAX.jpg", "cast": "Eddie Redmayne, Alicia Vikander, Matthias Schoenaerts, Ben Whishaw, Sebastian Koch", "director": "Tom Hooper", "release_date": "2015-11-27"}, {"id": 22881, "title": "The Blind Side", "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.", "vote_average": 7.692, "runtime": 129, "poster_path": "https://image.tmdb.org/t/p/w500/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg", "cast": "Sandra Bullock, Tim McGraw, Quinton Aaron, Jae Head, Lily Collins", "director": "John Lee Hancock", "release_date": "2009-11-20"}, {"id": 492188, "title": "Marriage Story", "overview": "A stage director and an actress struggle through a grueling, coast-to-coast divorce that pushes them to their personal extremes.", "vote_average": 7.753, "runtime": 137, "poster_path": "https://image.tmdb.org/t/p/w500/91osxUqsq1JC0zJzB1CpAavlWu7.jpg", "cast": "Adam Driver, Scarlett Johansson, Laura Dern, Alan Alda, Ray Liotta", "director": "Noah Baumbach", "release_date": "2019-09-28"}, {"id": 380, "title": "Rain Man", "overview": "When car dealer Charlie Babbitt learns that his estranged father has died, he returns home to Cincinnati, where he discovers that he has a savant older brother named Raymond and that his father's $3 million fortune is being left to the mental institution in which Raymond lives. Motivated by his father's money, Charlie checks Raymond out of the facility in order to return with him to Los Angeles. The brothers' cross-country trip ends up changing both their lives.", "vote_average": 7.756, "runtime": 134, "poster_path": "https://image.tmdb.org/t/p/w500/iTNHwO896WKkaoPtpMMS74d8VNi.jpg", "cast": "Dustin Hoffman, Tom Cruise, Valeria Golino, Gerald R. Molen, Jack Murdock", "director": "Barry Levinson", "release_date": "1988-12-12"}, {"id": 1402, "title": "The Pursuit of Happyness", "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.", "vote_average": 7.9, "runtime": 117, "poster_path": "https://image.tmdb.org/t/p/w500/kTdG9wKnREyjK6nlFDNmpe7wlIK.jpg", "cast": "Will Smith, Jaden Smith, Thandiwe Newton, Brian Howe, James Karen", "director": "Gabriele Muccino", "release_date": "2006-12-14"}, {"id": 316029, "title": "The Greatest Showman", "overview": "The story of American showman P.T. Barnum, founder of the circus that became the famous traveling Ringling Bros. and Barnum & Bailey Circus.", "vote_average": 7.908, "runtime": 105, "poster_path": "https://image.tmdb.org/t/p/w500/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg", "cast": "Hugh Jackman, Zac Efron, Michelle Williams, Rebecca Ferguson, Zendaya", "director": "Michael Gracey", "release_date": "2017-12-20"}, {"id": 7345, "title": "There Will Be Blood", "overview": "Ruthless silver miner, turned oil prospector, Daniel Plainview, moves to oil-rich California. Using his son to project a trustworthy, family-man image, Plainview cons local landowners into selling him their valuable properties for a pittance. However, local preacher Eli Sunday suspects Plainview's motives and intentions, starting a slow-burning feud that threatens both their lives.", "vote_average": 8.085, "runtime": 158, "poster_path": "https://image.tmdb.org/t/p/w500/fa0RDkAlCec0STeMNAhPaF89q6U.jpg", "cast": "Daniel Day-Lewis, Paul Dano, Kevin J. O'Connor, Ciarán Hinds, Dillon Freasier", "director": "Paul Thomas Anderson", "release_date": "2007-12-26"}, {"id": 84892, "title": "The Perks of Being a Wallflower", "overview": "Pittsburgh, Pennsylvania, 1991. High school freshman Charlie is a wallflower, always watching life from the sidelines, until two senior students, Sam and her stepbrother Patrick, become his mentors, helping him discover the joys of friendship, music and love.", "vote_average": 7.8, "runtime": 103, "poster_path": "https://image.tmdb.org/t/p/w500/aKCvdFFF5n80P2VdS7d8YBwbCjh.jpg", "cast": "Logan Lerman, Emma Watson, Ezra Miller, Mae Whitman, Kate Walsh", "director": "Stephen Chbosky", "release_date": "2012-09-20"}, {"id": 381284, "title": "Hidden Figures", "overview": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.", "vote_average": 8.058, "runtime": 127, "poster_path": "https://image.tmdb.org/t/p/w500/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg", "cast": "Taraji P. Henson, Octavia Spencer, Janelle Monáe, Kevin Costner, Kirsten Dunst", "director": "Theodore Melfi", "release_date": "2016-12-10"}, {"id": 76203, "title": "12 Years a Slave", "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.", "vote_average": 7.945, "runtime": 134, "poster_path": "https://image.tmdb.org/t/p/w500/xdANQijuNrJaw1HA61rDccME4Tm.jpg", "cast": "Chiwetel Ejiofor, Michael Fassbender, Lupita Nyong'o, Benedict Cumberbatch, Paul Dano", "director": "Steve McQueen", "release_date": "2013-10-18"}, {"id": 28178, "title": "Hachi: A Dog's Tale", "overview": "A drama based on the true story of a college professor's bond with the abandoned dog he takes into his home.", "vote_average": 8.006, "runtime": 93, "poster_path": "https://image.tmdb.org/t/p/w500/lsy3aEsEfYIHdLRk4dontZ4s85h.jpg", "cast": "Richard Gere, Joan Allen, Sarah Roemer, Cary-Hiroyuki Tagawa, Erick Avari", "director": "Lasse Hallström", "release_date": "2009-06-08"}, {"id": 28, "title": "Apocalypse Now", "overview": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.", "vote_average": 8.282, "runtime": 147, "poster_path": "https://image.tmdb.org/t/p/w500/eQVH91OSxh5I2uRfJuw4owd2Fq9.jpg", "cast": "Martin Sheen, Marlon Brando, Frederic Forrest, Albert Hall, Laurence Fishburne", "director": "Francis Ford Coppola", "release_date": "1979-08-15"}, {"id": 600, "title": "Full Metal Jacket", "overview": "A pragmatic U.S. Marine observes the dehumanizing effects the U.S.-Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.", "vote_average": 8.136, "runtime": 117, "poster_path": "https://image.tmdb.org/t/p/w500/kMKyx1k8hWWscYFnPbnxxN4Eqo4.jpg", "cast": "Matthew Modine, Adam Baldwin, Vincent D'Onofrio, R. Lee Ermey, Dorian Harewood", "director": "Stanley Kubrick", "release_date": "1987-06-26"}, {"id": 68718, "title": "Django Unchained", "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.", "vote_average": 8.171, "runtime": 165, "poster_path": "https://image.tmdb.org/t/p/w500/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg", "cast": "Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, Samuel L. Jackson", "director": "Quentin Tarantino", "release_date": "2012-12-25"}, {"id": 244786, "title": "Whiplash", "overview": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.", "vote_average": 8.381, "runtime": 107, "poster_path": "https://image.tmdb.org/t/p/w500/7fn624j5lj3xTme2SgiLCeuedmO.jpg", "cast": "Miles Teller, J.K. Simmons, Paul Reiser, Melissa Benoist, Austin Stowell", "director": "Damien Chazelle", "release_date": "2014-10-10"}, {"id": 423, "title": "The Pianist", "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.", "vote_average": 8.382, "runtime": 150, "poster_path": "https://image.tmdb.org/t/p/w500/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg", "cast": "Adrien Brody, Thomas Kretschmann, Frank Finlay, Maureen Lipman, Emilia Fox", "director": "Roman Polanski", "release_date": "2002-09-17"}, {"id": 185, "title": "A Clockwork Orange", "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?", "vote_average": 8.2, "runtime": 137, "poster_path": "https://image.tmdb.org/t/p/w500/4sHeTAp65WrSSuc05nRBKddhBxO.jpg", "cast": "Malcolm McDowell, Patrick Magee, Carl Duering, Michael Bates, Warren Clarke", "director": "Stanley Kubrick", "release_date": "1971-12-19"}, {"id": 8358, "title": "Cast Away", "overview": "Chuck Nolan, a top international manager for FedEx, and Kelly, a Ph.D. student, are in love and heading towards marriage. Then Chuck's plane to Malaysia crashes at sea during a terrible storm. He's the only survivor, and finds himself marooned on a desolate island. With no way to escape, Chuck must find ways to survive in his new home.", "vote_average": 7.662, "runtime": 143, "poster_path": "https://image.tmdb.org/t/p/w500/7lLJgKnAicAcR5UEuo8xhSMj18w.jpg", "cast": "Tom Hanks, Helen Hunt, Chris Noth, Paul Sanchez, Lari White", "director": "Robert Zemeckis", "release_date": "2000-12-22"}, {"id": 87502, "title": "Flight", "overview": "Commercial airline pilot Whip Whitaker has a problem with drugs and alcohol, though so far he's managed to complete his flights safely. His luck runs out when a disastrous mechanical malfunction sends his plane hurtling toward the ground. Whip pulls off a miraculous crash-landing that results in only six lives lost. Shaken to the core, Whip vows to get sober -- but when the crash investigation exposes his addiction, he finds himself in an even worse situation.", "vote_average": 6.818, "runtime": 138, "poster_path": "https://image.tmdb.org/t/p/w500/1AjXgBM2lkpG3FLQO0f6AK3Bi1e.jpg", "cast": "Denzel Washington, Don Cheadle, Kelly Reilly, John Goodman, Bruce Greenwood", "director": "Robert Zemeckis", "release_date": "2012-11-02"}, {"id": 37799, "title": "The Social Network", "overview": "The tale of a new breed of cultural insurgent: a punk genius who sparked a revolution and changed the face of human interaction for a generation, and perhaps forever.", "vote_average": 7.358, "runtime": 121, "poster_path": "https://image.tmdb.org/t/p/w500/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg", "cast": "Jesse Eisenberg, Andrew Garfield, Armie Hammer, Josh Pence, Justin Timberlake", "director": "David Fincher", "release_date": "2010-10-01"}, {"id": 376867, "title": "Moonlight", "overview": "The tender, heartbreaking story of a young man’s struggle to find himself, told across three defining chapters in his life as he experiences the ecstasy, pain, and beauty of falling in love, while grappling with his own sexuality.", "vote_average": 7.392, "runtime": 111, "poster_path": "https://image.tmdb.org/t/p/w500/4911T5FbJ9eD2Faz5Z8cT3SUhU3.jpg", "cast": "Trevante Rhodes, André Holland, Janelle Monáe, Ashton Sanders, Jharrel Jerome", "director": "Barry Jenkins", "release_date": "2016-10-21"}, {"id": 11321, "title": "Seven Pounds", "overview": "An IRS agent with a fateful secret embarks on an extraordinary journey of redemption by forever changing the lives of seven strangers.", "vote_average": 7.613, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/pCVpsCEYtvtlg1I9h3rtglKgThu.jpg", "cast": "Will Smith, Rosario Dawson, Woody Harrelson, Michael Ealy, Barry Pepper", "director": "Gabriele Muccino", "release_date": "2008-12-18"}, {"id": 490132, "title": "Green Book", "overview": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.", "vote_average": 8.242, "runtime": 130, "poster_path": "https://image.tmdb.org/t/p/w500/7BsvSuDQuoqhWmU2fL7W2GOcZHU.jpg", "cast": "Viggo Mortensen, Mahershala Ali, Linda Cardellini, Sebastian Maniscalco, Dimiter D. Marinov", "director": "Peter Farrelly", "release_date": "2018-11-16"}, {"id": 4348, "title": "Pride & Prejudice", "overview": "A story of love and life among the landed English gentry during the Georgian era. Mr. Bennet is a gentleman living in Hertfordshire with his overbearing wife and five daughters, but if he dies their house will be inherited by a distant cousin whom they have never met, so the family's future happiness and security is dependent on the daughters making good marriages.", "vote_average": 8.083, "runtime": 127, "poster_path": "https://image.tmdb.org/t/p/w500/sGjIvtVvTlWnia2zfJfHz81pZ9Q.jpg", "cast": "Keira Knightley, Matthew Macfadyen, Brenda Blethyn, Rosamund Pike, Carey Mulligan", "director": "Joe Wright", "release_date": "2005-09-16"}, {"id": 597, "title": "Titanic", "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.", "vote_average": 7.9, "runtime": 194, "poster_path": "https://image.tmdb.org/t/p/w500/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg", "cast": "Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Frances Fisher", "director": "James Cameron", "release_date": "1997-11-18"}, {"id": 11036, "title": "The Notebook", "overview": "An epic love story centered around an older man who reads aloud to a woman with Alzheimer's. From a faded notebook, the old man's words bring to life the story about a couple who is separated by World War II, and is then passionately reunited, seven years later, after they have taken different paths.", "vote_average": 7.88, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/rNzQyW4f8B8cQeg7Dgj3n6eT5k9.jpg", "cast": "Ryan Gosling, Rachel McAdams, Gena Rowlands, James Garner, Joan Allen", "director": "Nick Cassavetes", "release_date": "2004-06-25"}, {"id": 120467, "title": "The Grand Budapest Hotel", "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.", "vote_average": 8.049, "runtime": 100, "poster_path": "https://image.tmdb.org/t/p/w500/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg", "cast": "Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe", "director": "Wes Anderson", "release_date": "2014-02-26"}, {"id": 37165, "title": "The Truman Show", "overview": "Truman Burbank is the star of The Truman Show, a 24-hour-a-day reality TV show that broadcasts every aspect of his life without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows, including his wife and his best friend, is really an actor, paid to be part of his life.", "vote_average": 8.133, "runtime": 103, "poster_path": "https://image.tmdb.org/t/p/w500/vuza0WqY239yBXOadKlGwJsZJFE.jpg", "cast": "Jim Carrey, Laura Linney, Noah Emmerich, Natascha McElhone, Holland Taylor", "director": "Peter Weir", "release_date": "1998-06-04"}, {"id": 398818, "title": "Call Me by Your Name", "overview": "In 1980s Italy, a relationship begins between seventeen-year-old teenage Elio and the older adult man hired as his father's research assistant.", "vote_average": 8.167, "runtime": 132, "poster_path": "https://image.tmdb.org/t/p/w500/mZ4gBdfkhP9tvLH1DO4m4HYtiyi.jpg", "cast": "Armie Hammer, Timothée Chalamet, Michael Stuhlbarg, Amira Casar, Esther Garrel", "director": "Luca Guadagnino", "release_date": "2017-09-01"}, {"id": 17431, "title": "Moon", "overview": "With only three weeks left in his three year contract, Sam Bell is getting anxious to finally return to Earth. He is the only occupant of a Moon-based manufacturing facility along with his computer and assistant, GERTY. When he has an accident however, he wakens to find that he is not alone.", "vote_average": 7.57, "runtime": 97, "poster_path": "https://image.tmdb.org/t/p/w500/35IU0Mq0zFsN1mYwDGts5mKc77n.jpg", "cast": "Sam Rockwell, Kevin Spacey, Dominique McElligott, Rosie Shaw, Adrienne Shaw", "director": "Duncan Jones", "release_date": "2009-06-12"}, {"id": 264660, "title": "Ex Machina", "overview": "Caleb, a coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.", "vote_average": 7.572, "runtime": 108, "poster_path": "https://image.tmdb.org/t/p/w500/dmJW8IAKHKxFNiUnoDR7JfsK7Rp.jpg", "cast": "Domhnall Gleeson, Alicia Vikander, Oscar Isaac, Sonoya Mizuno, Corey Johnson", "director": "Alex Garland", "release_date": "2015-01-21"}, {"id": 335984, "title": "Blade Runner 2049", "overview": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years.", "vote_average": 7.544, "runtime": 164, "poster_path": "https://image.tmdb.org/t/p/w500/gajva2L0rPYkEWjzgFlBXCAVBE5.jpg", "cast": "Ryan Gosling, Harrison Ford, Ana de Armas, Dave Bautista, Robin Wright", "director": "Denis Villeneuve", "release_date": "2017-10-04"}, {"id": 2108, "title": "The Breakfast Club", "overview": "Five high school students from different walks of life endure a Saturday detention under a power-hungry principal. The disparate group includes rebel John, princess Claire, outcast Allison, brainy Brian and Andrew, the jock. Each has a chance to tell his or her story, making the others see them a little differently -- and when the day ends, they question whether school will ever be the same.", "vote_average": 7.751, "runtime": 98, "poster_path": "https://image.tmdb.org/t/p/w500/9nai8pRm4Ja0O265Qp6UyqXlLQ8.jpg", "cast": "Emilio Estevez, Judd Nelson, Molly Ringwald, Anthony Michael Hall, Ally Sheedy", "director": "John Hughes", "release_date": "1985-02-15"}, {"id": 222935, "title": "The Fault in Our Stars", "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.", "vote_average": 7.598, "runtime": 126, "poster_path": "https://image.tmdb.org/t/p/w500/ep7dF4QR4Mm39LI958V0XbwE0hK.jpg", "cast": "Shailene Woodley, Ansel Elgort, Nat Wolff, Laura Dern, Sam Trammell", "director": "Josh Boone", "release_date": "2014-05-16"}, {"id": 1366, "title": "Rocky", "overview": "An uneducated collector for a Philadelphia loan shark is given a once-in-a-lifetime opportunity to fight against the world heavyweight boxing champion.", "vote_average": 7.8, "runtime": 119, "poster_path": "https://image.tmdb.org/t/p/w500/cqxg1CihGR5ge0i1wYXr4Rdeppu.jpg", "cast": "Sylvester Stallone, Talia Shire, Burt Young, Carl Weathers, Burgess Meredith", "director": "John G. Avildsen", "release_date": "1976-11-21"}, {"id": 142, "title": "Brokeback Mountain", "overview": "Rodeo cowboy Jack and ranch hand Ennis are hired as sheepherders in 1963 Wyoming. One night on Brokeback Mountain, they spark a physical relationship. Though Ennis marries his longtime sweetheart and Jack marries a fellow rodeo rider, they keep up their tortured, sporadic love affair for 20 years.", "vote_average": 7.799, "runtime": 134, "poster_path": "https://image.tmdb.org/t/p/w500/fsbzfe9eLOEl5rJX04nPEr1eoAi.jpg", "cast": "Heath Ledger, Jake Gyllenhaal, Michelle Williams, Anne Hathaway, Randy Quaid", "director": "Ang Lee", "release_date": "2005-09-10"}, {"id": 12405, "title": "Slumdog Millionaire", "overview": "A teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".", "vote_average": 7.734, "runtime": 120, "poster_path": "https://image.tmdb.org/t/p/w500/5leCCi7ZF0CawAfM5Qo2ECKPprc.jpg", "cast": "Dev Patel, Freida Pinto, Madhur Mittal, Anil Kapoor, Mahesh Manjrekar", "director": "Danny Boyle", "release_date": "2008-11-12"}, {"id": 331482, "title": "Little Women", "overview": "Four sisters come of age in America in the aftermath of the Civil War.", "vote_average": 7.895, "runtime": 135, "poster_path": "https://image.tmdb.org/t/p/w500/yn5ihODtZ7ofn8pDYfxCmxh8AXI.jpg", "cast": "Saoirse Ronan, Emma Watson, Florence Pugh, Eliza Scanlen, Laura Dern", "director": "Greta Gerwig", "release_date": "2019-12-25"}, {"id": 266856, "title": "The Theory of Everything", "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.", "vote_average": 7.86, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/wucOQrqihOtHToP7UAPKMFRJ9LL.jpg", "cast": "Eddie Redmayne, Felicity Jones, Charlie Cox, Emily Watson, Simon McBurney", "director": "James Marsh", "release_date": "2014-11-26"}, {"id": 453, "title": "A Beautiful Mind", "overview": "John Nash is a brilliant but asocial mathematician fighting schizophrenia. After he accepts secret work in cryptography, his life takes a turn for the nightmarish.", "vote_average": 7.851, "runtime": 135, "poster_path": "https://image.tmdb.org/t/p/w500/zwzWCmH72OSC9NA0ipoqw5Zjya8.jpg", "cast": "Russell Crowe, Jennifer Connelly, Ed Harris, Paul Bettany, Christopher Plummer", "director": "Ron Howard", "release_date": "2001-12-11"}, {"id": 273248, "title": "The Hateful Eight", "overview": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.", "vote_average": 7.746, "runtime": 188, "poster_path": "https://image.tmdb.org/t/p/w500/jIywvdPjia2t3eKYbjVTcwBQlG8.jpg", "cast": "Samuel L. Jackson, Kurt Russell, Jennifer Jason Leigh, Walton Goggins, Demián Bichir", "director": "Quentin Tarantino", "release_date": "2015-12-25"}, {"id": 11324, "title": "Shutter Island", "overview": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by troubling visions and a mysterious doctor.", "vote_average": 8.2, "runtime": 138, "poster_path": "https://image.tmdb.org/t/p/w500/4GDy0PHYX3VRXUtwK5ysFbg3kEx.jpg", "cast": "Leonardo DiCaprio, Mark Ruffalo, Ben Kingsley, Max von Sydow, Michelle Williams", "director": "Martin Scorsese", "release_date": "2010-02-14"}, {"id": 9552, "title": "The Exorcist", "overview": "12-year-old Regan MacNeil begins to adapt an explicit new personality as strange events befall the local area of Georgetown. Her mother becomes torn between science and superstition in a desperate bid to save her daughter, and ultimately turns to her last hope: Father Damien Karras, a troubled priest who is struggling with his own faith.", "vote_average": 7.72, "runtime": 122, "poster_path": "https://image.tmdb.org/t/p/w500/4ucLGcXVVSVnsfkGtbLY4XAius8.jpg", "cast": "Ellen Burstyn, Linda Blair, Jason Miller, Max von Sydow, Lee J. Cobb", "director": "William Friedkin", "release_date": "1973-12-26"}, {"id": 141, "title": "Donnie Darko", "overview": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.", "vote_average": 7.8, "runtime": 114, "poster_path": "https://image.tmdb.org/t/p/w500/j73zf3TjWR9j8pHLndaHWh0YWvN.jpg", "cast": "Jake Gyllenhaal, Jena Malone, James Duval, Drew Barrymore, Beth Grant", "director": "Richard Kelly", "release_date": "2001-10-24"}, {"id": 447332, "title": "A Quiet Place", "overview": "A family is forced to live in silence while hiding from creatures that hunt by sound.", "vote_average": 7.396, "runtime": 91, "poster_path": "https://image.tmdb.org/t/p/w500/nAU74GmpUk7t5iklEp3bufwDq4n.jpg", "cast": "Emily Blunt, John Krasinski, Millicent Simmonds, Noah Jupe, Cade Woodward", "director": "John Krasinski", "release_date": "2018-04-03"}, {"id": 329865, "title": "Arrival", "overview": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.", "vote_average": 7.6, "runtime": 116, "poster_path": "https://image.tmdb.org/t/p/w500/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg", "cast": "Amy Adams, Jeremy Renner, Forest Whitaker, Michael Stuhlbarg, Mark O'Brien", "director": "Denis Villeneuve", "release_date": "2016-11-10"}, {"id": 1124, "title": "The Prestige", "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.", "vote_average": 8.203, "runtime": 130, "poster_path": "https://image.tmdb.org/t/p/w500/Ag2B2KHKQPukjH7WutmgnnSNurZ.jpg", "cast": "Hugh Jackman, Christian Bale, Michael Caine, Piper Perabo, Rebecca Hall", "director": "Christopher Nolan", "release_date": "2006-10-19"}, {"id": 242224, "title": "The Babadook", "overview": "A single mother, plagued by the violent death of her husband, battles with her son's fear of a monster lurking in the house, but soon discovers a sinister presence all around her.", "vote_average": 6.52, "runtime": 94, "poster_path": "https://image.tmdb.org/t/p/w500/lszpCmmPCKHvzn2OBx7bAgXlfhC.jpg", "cast": "Essie Davis, Noah Wiseman, Hayley McElhinney, Daniel Henshall, Barbara West", "director": "Jennifer Kent", "release_date": "2014-05-22"}, {"id": 15, "title": "Citizen Kane", "overview": "Newspaper magnate, Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.", "vote_average": 8.015, "runtime": 119, "poster_path": "https://image.tmdb.org/t/p/w500/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg", "cast": "Orson Welles, Joseph Cotten, Dorothy Comingore, Ray Collins, George Coulouris", "director": "Orson Welles", "release_date": "1941-04-17"}, {"id": 37135, "title": "Tarzan", "overview": "Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...", "vote_average": 7.402, "runtime": 88, "poster_path": "https://image.tmdb.org/t/p/w500/bTvHlcqiOjGa3lFtbrTLTM3zasY.jpg", "cast": "Tony Goldwyn, Minnie Driver, Glenn Close, Alex D. Linz, Rosie O'Donnell", "director": "Chris Buck, Kevin Lima", "release_date": "1999-06-18"}, {"id": 62211, "title": "Monsters University", "overview": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends.", "vote_average": 7, "runtime": 104, "poster_path": "https://image.tmdb.org/t/p/w500/y7thwJ7z5Bplv6vwl6RI0yteaDD.jpg", "cast": "Billy Crystal, John Goodman, Steve Buscemi, Helen Mirren, Peter Sohn", "director": "Dan Scanlon", "release_date": "2013-06-19"}, {"id": 49444, "title": "Kung Fu Panda 2", "overview": "Po is now living his dream as The Dragon Warrior, protecting the Valley of Peace alongside his friends and fellow kung fu masters, The Furious Five - Tigress, Crane, Mantis, Viper and Monkey. But Po’s new life of awesomeness is threatened by the emergence of a formidable villain, who plans to use a secret, unstoppable weapon to conquer China and destroy kung fu. It is up to Po and The Furious Five to journey across China to face this threat and vanquish it. But how can Po stop a weapon that can stop kung fu? He must look to his past and uncover the secrets of his mysterious origins; only then will he be able to unlock the strength he needs to succeed.", "vote_average": 6.968, "runtime": 91, "poster_path": "https://image.tmdb.org/t/p/w500/mtqqD00vB4PGRt20gWtGqFhrkd0.jpg", "cast": "Jack Black, Angelina Jolie, Dustin Hoffman, Gary Oldman, Jackie Chan", "director": "Jennifer Yuh Nelson", "release_date": "2011-05-25"}, {"id": 10895, "title": "Pinocchio", "overview": "When loving Geppetto creates a wooden puppet, his wish is granted when it comes to life as a little wooden boy named Pinocchio. With his faithful friend and conscience Jiminy Cricket by his side, Pinocchio, embarks on fantastic adventures that his bravery, loyalty and honesty until triumphs in his triumphs in his quest for his heart's desire: to become a real boy.", "vote_average": 7.102, "runtime": 88, "poster_path": "https://image.tmdb.org/t/p/w500/bnZJrLRnoQHpzEJdka1KYfsAF3N.jpg", "cast": "Dickie Jones, Cliff Edwards, Christian Rub, Evelyn Venable, Walter Catlett", "director": "Hamilton Luske, Ben Sharpsteen, T. Hee, Wilfred Jackson, Norman Ferguson, Jack Kinney, Bill Roberts", "release_date": "1940-02-23"}, {"id": 11544, "title": "Lilo & Stitch", "overview": "As Stitch, a runaway genetic experiment from a faraway planet, wreaks havoc on the Hawaiian Islands, he becomes the mischievous adopted alien \"puppy\" of an independent little girl named Lilo and learns about loyalty, friendship, and ʻohana, the Hawaiian tradition of family.", "vote_average": 7.516, "runtime": 85, "poster_path": "https://image.tmdb.org/t/p/w500/d73UqZWyw3MUMpeaFcENgLZ2kWS.jpg", "cast": "Daveigh Chase, Chris Sanders, Tia Carrere, David Ogden Stiers, Kevin McDonald", "director": "Dean DeBlois, Chris Sanders", "release_date": "2002-06-21"}, {"id": 38757, "title": "Tangled", "overview": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.", "vote_average": 7.599, "runtime": 100, "poster_path": "https://image.tmdb.org/t/p/w500/ym7Kst6a4uodryxqbGOxmewF235.jpg", "cast": "Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey", "director": "Nathan Greno, Byron Howard", "release_date": "2010-11-24"}, {"id": 12, "title": "Finding Nemo", "overview": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.", "vote_average": 7.824, "runtime": 100, "poster_path": "https://image.tmdb.org/t/p/w500/ggQ6o8X5984OCh3kZi2UIJQJY5y.jpg", "cast": "Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, Geoffrey Rush", "director": "Andrew Stanton", "release_date": "2003-05-30"}, {"id": 10386, "title": "The Iron Giant", "overview": "In the small town of Rockwell, Maine in October 1957, a giant metal machine befriends a nine-year-old boy and ultimately finds its humanity by unselfishly saving people from their own fears and prejudices.", "vote_average": 7.925, "runtime": 86, "poster_path": "https://image.tmdb.org/t/p/w500/mThOw5rXLtdbY3WmuTsS9zsQBMG.jpg", "cast": "Jennifer Aniston, Harry Connick Jr., Vin Diesel, James Gammon, Cloris Leachman", "director": "Brad Bird", "release_date": "1999-08-06"}, {"id": 3170, "title": "Bambi", "overview": "Bambi's tale unfolds from season to season as the young prince of the forest learns about life, love, and friends.", "vote_average": 7, "runtime": 70, "poster_path": "https://image.tmdb.org/t/p/w500/wV9e2y4myJ4KMFsyFfWYcUOawyK.jpg", "cast": "Donnie Dunagan, Peter Behn, Stan Alexander, Cammie King, Will Wright", "director": "David Hand", "release_date": "1942-08-14"}, {"id": 8587, "title": "The Lion King", "overview": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?", "vote_average": 8.256, "runtime": 89, "poster_path": "https://image.tmdb.org/t/p/w500/sKCr78MXSLixwmZ8DyJLrpMsd15.jpg", "cast": "Matthew Broderick, Moira Kelly, Nathan Lane, Ernie Sabella, James Earl Jones", "director": "Roger Allers, Rob Minkoff", "release_date": "1994-06-24"}, {"id": 391713, "title": "Lady Bird", "overview": "Lady Bird McPherson, a strong willed, deeply opinionated, artistic 17 year old comes of age in Sacramento. Her relationship with her mother and her upbringing are questioned and tested as she plans to head off to college.", "vote_average": 7.271, "runtime": 94, "poster_path": "https://image.tmdb.org/t/p/w500/iySFtKLrWvVzXzlFj7x1zalxi5G.jpg", "cast": "Saoirse Ronan, Laurie Metcalf, Tracy Letts, Lucas Hedges, Timothée Chalamet", "director": "Greta Gerwig", "release_date": "2017-09-01"}, {"id": 389015, "title": "I, Tonya", "overview": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the sport is thrown into doubt when her ex-husband intervenes.", "vote_average": 7.501, "runtime": 120, "poster_path": "https://image.tmdb.org/t/p/w500/6gNXwSHxaksR1PjVZRqNapmkgj3.jpg", "cast": "Margot Robbie, Sebastian Stan, Allison Janney, Julianne Nicholson, Paul Walter Hauser", "director": "Craig Gillespie", "release_date": "2017-12-08"}, {"id": 194662, "title": "Birdman or (The Unexpected Virtue of Ignorance)", "overview": "A fading actor best known for his portrayal of a popular superhero attempts to mount a comeback by appearing in a Broadway play. As opening night approaches, his attempts to become more altruistic, rebuild his career, and reconnect with friends and family prove more difficult than expected.", "vote_average": 7.471, "runtime": 120, "poster_path": "https://image.tmdb.org/t/p/w500/rHUg2AuIuLSIYMYFgavVwqt1jtc.jpg", "cast": "Michael Keaton, Emma Stone, Zach Galifianakis, Edward Norton, Andrea Riseborough", "director": "Alejandro González Iñárritu", "release_date": "2014-10-17"}, {"id": 773, "title": "Little Miss Sunshine", "overview": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.", "vote_average": 7.677, "runtime": 102, "poster_path": "https://image.tmdb.org/t/p/w500/tFnTds88mCuLcLPBseK1kF2E3qv.jpg", "cast": "Greg Kinnear, Toni Collette, Steve Carell, Paul Dano, Abigail Breslin", "director": "Valerie Faris, Jonathan Dayton", "release_date": "2006-07-26"}, {"id": 64682, "title": "The Great Gatsby", "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.", "vote_average": 7.379, "runtime": 143, "poster_path": "https://image.tmdb.org/t/p/w500/nimh1rrDDLhgpG8XAYoUZXHYwb6.jpg", "cast": "Leonardo DiCaprio, Tobey Maguire, Carey Mulligan, Joel Edgerton, Elizabeth Debicki", "director": "Baz Luhrmann", "release_date": "2013-05-09"}, {"id": 153, "title": "Lost in Translation", "overview": "Two lost souls visiting Tokyo -- the young, neglected wife of a photographer and a washed-up movie star shooting a TV commercial -- find an odd solace and pensive freedom to be real in each other's company, away from their lives in America.", "vote_average": 7.392, "runtime": 102, "poster_path": "https://image.tmdb.org/t/p/w500/wkSzJs7oMf8MIr9CQVICsvRfwA7.jpg", "cast": "Bill Murray, Scarlett Johansson, Giovanni Ribisi, Anna Faris, Akiko Takeshita", "director": "Sofia Coppola", "release_date": "2003-09-18"}, {"id": 83542, "title": "Cloud Atlas", "overview": "A set of six nested stories spanning time between the 19th century and a distant post-apocalyptic future. Cloud Atlas explores how the actions and consequences of individual lives impact one another throughout the past, the present and the future. Action, mystery and romance weave through the story as one soul is shaped from a killer into a hero and a single act of kindness ripples across centuries to inspire a revolution in the distant future.  Based on the award winning novel by David Mitchell. Directed by Tom Tykwer and the Wachowskis.", "vote_average": 6.884, "runtime": 172, "poster_path": "https://image.tmdb.org/t/p/w500/8naVv2Xu3rWI5JKHz0vCujx6GaJ.jpg", "cast": "Tom Hanks, Halle Berry, Jim Broadbent, Hugo Weaving, Jim Sturgess", "director": "Lana Wachowski, Lilly Wachowski, Tom Tykwer", "release_date": "2012-10-26"}, {"id": 65, "title": "8 Mile", "overview": "For Jimmy Smith, Jr., life is a daily fight just to keep hope alive. Feeding his dreams in Detroit's vibrant music scene, Jimmy wages an extraordinary personal struggle to find his own voice - and earn a place in a world where rhymes rule, legends are born and every moment… is another chance.", "vote_average": 7.124, "runtime": 111, "poster_path": "https://image.tmdb.org/t/p/w500/7BmQj8qE1FLuLTf7Xjf9sdIHzoa.jpg", "cast": "Eminem, Kim Basinger, Mekhi Phifer, Brittany Murphy, Evan Jones", "director": "Curtis Hanson", "release_date": "2002-11-08"}, {"id": 4553, "title": "The Machinist", "overview": "Trevor, an insomniac lathe operator, experiences unusual occurrences at work and home. A strange man follows him everywhere, but no one else seems to notice him.", "vote_average": 7.52, "runtime": 101, "poster_path": "https://image.tmdb.org/t/p/w500/diAYqR4xdF9Hnj7qun6DEQhRrT2.jpg", "cast": "Christian Bale, Jennifer Jason Leigh, Aitana Sánchez-Gijón, John Sharian, Michael Ironside", "director": "Brad Anderson", "release_date": "2004-07-02"}, {"id": 45269, "title": "The King's Speech", "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.", "vote_average": 7.74, "runtime": 118, "poster_path": "https://image.tmdb.org/t/p/w500/uQ538BfYLDJh3GXlzRZLo0j7PFj.jpg", "cast": "Colin Firth, Geoffrey Rush, Helena Bonham Carter, Guy Pearce, Timothy Spall", "director": "Tom Hooper", "release_date": "2010-11-26"}, {"id": 361743, "title": "Top Gun: Maverick", "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.", "vote_average": 8.26, "runtime": 131, "poster_path": "https://image.tmdb.org/t/p/w500/62HCnUTziyWcpDaBO2i1DX17ljH.jpg", "cast": "Tom Cruise, Val Kilmer, Miles Teller, Jennifer Connelly, Bashir Salahuddin", "director": "Joseph Kosinski", "release_date": "2022-05-24"}, {"id": 152532, "title": "Dallas Buyers Club", "overview": "Loosely based on the true-life tale of Ron Woodroof, a drug-taking, women-loving, homophobic man who in 1986 was diagnosed with HIV/AIDS and given thirty days to live.", "vote_average": 7.932, "runtime": 117, "poster_path": "https://image.tmdb.org/t/p/w500/7Fdh7gUq3plvQqxRbNYhWvDABXA.jpg", "cast": "Matthew McConaughey, Jennifer Garner, Jared Leto, Denis O'Hare, Steve Zahn", "director": "Jean-Marc Vallée", "release_date": "2013-11-01"}, {"id": 41733, "title": "Due Date", "overview": "Peter Highman must scramble across the US in five days to be present for the birth of his first child. He gets off to a bad start when his wallet and luggage are stolen, and put on the 'no-fly' list. Peter embarks on a terrifying journey when he accepts a ride from an actor.", "vote_average": 6.35, "runtime": 95, "poster_path": "https://image.tmdb.org/t/p/w500/4dzo4uWmkgp20uwm0jpiduRtvju.jpg", "cast": "Robert Downey Jr., Zach Galifianakis, Michelle Monaghan, Jamie Foxx, Juliette Lewis", "director": "Todd Phillips", "release_date": "2010-11-03"}, {"id": 594, "title": "The Terminal", "overview": "Viktor Navorski is a man without a country; his plane took off just as a coup d'etat exploded in his homeland, leaving it in shambles, and now he's stranded at Kennedy Airport, where he's holding a passport that nobody recognizes. While quarantined in the transit lounge until authorities can figure out what to do with him, Viktor simply goes on living – and courts romance with a beautiful flight attendant.", "vote_average": 7.33, "runtime": 128, "poster_path": "https://image.tmdb.org/t/p/w500/pXNomqKcKXAQbuWxehb2N3XFKfn.jpg", "cast": "Tom Hanks, Catherine Zeta-Jones, Stanley Tucci, Chi McBride, Diego Luna", "director": "Steven Spielberg", "release_date": "2004-06-17"}, {"id": 318846, "title": "The Big Short", "overview": "The men who made millions from a global economic meltdown.", "vote_average": 7.344, "runtime": 131, "poster_path": "https://image.tmdb.org/t/p/w500/isuQWbJPbjybBEWdcCaBUPmU0XO.jpg", "cast": "Steve Carell, Christian Bale, Ryan Gosling, Brad Pitt, Marisa Tomei", "director": "Adam McKay", "release_date": "2015-12-11"}, {"id": 788, "title": "Mrs. Doubtfire", "overview": "Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as a British nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.", "vote_average": 7.186, "runtime": 125, "poster_path": "https://image.tmdb.org/t/p/w500/shHrSmXS5140o6sQzgzXxn3KqSm.jpg", "cast": "Robin Williams, Sally Field, Lisa Jakub, Matthew Lawrence, Mara Wilson", "director": "Chris Columbus", "release_date": "1993-11-24"}, {"id": 168672, "title": "American Hustle", "overview": "A conman and his seductive partner are forced to work for a wild FBI agent, who pushes them into a world of Jersey power-brokers and the Mafia.", "vote_average": 6.848, "runtime": 138, "poster_path": "https://image.tmdb.org/t/p/w500/koXGRfatN0tURFWMA0Keb0p0Gtg.jpg", "cast": "Christian Bale, Bradley Cooper, Amy Adams, Jeremy Renner, Jennifer Lawrence", "director": "David O. Russell", "release_date": "2013-12-03"}, {"id": 296098, "title": "Bridge of Spies", "overview": "During the Cold War, the Soviet Union captures U.S. pilot Francis Gary Powers after shooting down his U-2 spy plane. Sentenced to 10 years in prison, Powers' only hope is New York lawyer James Donovan, recruited by a CIA operative to negotiate his release. Donovan boards a plane to Berlin, hoping to win the young man's freedom through a prisoner exchange. If all goes well, the Russians would get Rudolf Abel, the convicted spy who Donovan defended in court.", "vote_average": 7.222, "runtime": 141, "poster_path": "https://image.tmdb.org/t/p/w500/fmOOjHAQzxr0c1sfcY4qkiSRBH6.jpg", "cast": "Tom Hanks, Mark Rylance, Amy Ryan, Alan Alda, Sebastian Koch", "director": "Steven Spielberg", "release_date": "2015-10-15"}, {"id": 68734, "title": "Argo", "overview": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.", "vote_average": 7.275, "runtime": 120, "poster_path": "https://image.tmdb.org/t/p/w500/9LcnmIeKUfKeAxeCY82W9Jug416.jpg", "cast": "Ben Affleck, Bryan Cranston, Alan Arkin, John Goodman, Victor Garber", "director": "Ben Affleck", "release_date": "2012-10-11"}, {"id": 480530, "title": "Creed II", "overview": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.", "vote_average": 7.015, "runtime": 130, "poster_path": "https://image.tmdb.org/t/p/w500/v3QyboWRoA4O9RbcsqH8tJMe8EB.jpg", "cast": "Michael B. Jordan, Sylvester Stallone, Tessa Thompson, Wood Harris, Russell Hornsby", "director": "Steven Caple Jr.", "release_date": "2018-11-21"}, {"id": 312221, "title": "Creed", "overview": "The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.", "vote_average": 7.413, "runtime": 133, "poster_path": "https://image.tmdb.org/t/p/w500/1BfTsk5VWuw8FCocAhCyqnRbEzq.jpg", "cast": "Michael B. Jordan, Sylvester Stallone, Tessa Thompson, Phylicia Rashād, Andre Ward", "director": "Ryan Coogler", "release_date": "2015-11-25"}, {"id": 307081, "title": "Southpaw", "overview": "Billy \"The Great\" Hope, the reigning junior middleweight boxing champion, has an impressive career, a loving wife and daughter, and a lavish lifestyle. However, when tragedy strikes, Billy hits rock bottom, losing his family, his house and his manager. He soon finds an unlikely savior in Tick Willis, a former fighter who trains the city's toughest amateur boxers. With his future on the line, Hope fights to reclaim the trust of those he loves the most.", "vote_average": 7.362, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/kSQ49Fi3NVTqGGXILmxV2T2pdkG.jpg", "cast": "Jake Gyllenhaal, Rachel McAdams, Forest Whitaker, Oona Laurence, 50 Cent", "director": "Antoine Fuqua", "release_date": "2015-03-24"}, {"id": 363676, "title": "Sully", "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the Hudson River, saving the lives of all 155 souls aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.", "vote_average": 7.177, "runtime": 96, "poster_path": "https://image.tmdb.org/t/p/w500/r09ivJ1GGh5WArqRViRYDQLrTVG.jpg", "cast": "Tom Hanks, Aaron Eckhart, Anna Gunn, Holt McCallany, Mike O'Malley", "director": "Clint Eastwood", "release_date": "2016-09-07"}, {"id": 96721, "title": "Rush", "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.", "vote_average": 7.708, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/5akKFgS7eeXUw9rKTEujryKrH17.jpg", "cast": "Chris Hemsworth, Daniel Brühl, Olivia Wilde, Alexandra Maria Lara, Pierfrancesco Favino", "director": "Ron Howard", "release_date": "2013-09-02"}], "dislikes": [{"id": 50014, "title": "The Help", "overview": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.", "vote_average": 8.202, "runtime": 146, "poster_path": "https://image.tmdb.org/t/p/w500/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg", "cast": "Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain", "director": "Tate Taylor", "release_date": "2011-08-09"}, {"id": 641, "title": "Requiem for a Dream", "overview": "The hopes and dreams of four ambitious people are shattered when their drug addictions begin spiraling out of control. A look into addiction and how it overcomes the mind and body.", "vote_average": 8.027, "runtime": 102, "poster_path": "https://image.tmdb.org/t/p/w500/nOd6vjEmzCT0k4VYqsA2hwyi87C.jpg", "cast": "Ellen Burstyn, Jared Leto, Jennifer Connelly, Marlon Wayans, Christopher McDonald", "director": "Darren Aronofsky", "release_date": "2000-10-06"}, {"id": 111, "title": "Scarface", "overview": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.", "vote_average": 8.168, "runtime": 169, "poster_path": "https://image.tmdb.org/t/p/w500/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg", "cast": "Al Pacino, Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio, Robert Loggia", "director": "Brian De Palma", "release_date": "1983-12-09"}, {"id": 359940, "title": "Three Billboards Outside Ebbing, Missouri", "overview": "After seven months have passed without a culprit in her daughter's murder case, Mildred Hayes makes a bold move, painting three signs leading into her town with a controversial message directed at Bill Willoughby, the town's revered chief of police. When his second-in-command Officer Jason Dixon, an immature mother's boy with a penchant for violence, gets involved, the battle between Mildred and Ebbing's law enforcement is only exacerbated.", "vote_average": 8.081, "runtime": 115, "poster_path": "https://image.tmdb.org/t/p/w500/pZRhqJj0DBy4ghB7g6pU7MGHsWJ.jpg", "cast": "Frances McDormand, Woody Harrelson, Sam Rockwell, Lucas Hedges, Abbie Cornish", "director": "Martin McDonagh", "release_date": "2017-12-01"}, {"id": 101, "title": "Léon: The Professional", "overview": "Léon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Léon's footsteps.", "vote_average": 8.316, "runtime": 111, "poster_path": "https://image.tmdb.org/t/p/w500/yI6X2cCM5YPJtxMhUd3dPGqDAhw.jpg", "cast": "Jean Reno, Natalie Portman, Gary Oldman, Danny Aiello, Peter Appel", "director": "Luc Besson", "release_date": "1994-09-14"}, {"id": 70, "title": "Million Dollar Baby", "overview": "Despondent over a painful estrangement from his daughter, trainer Frankie Dunn isn't prepared for boxer Maggie Fitzgerald to enter his life. But Maggie's determined to go pro and to convince Dunn and his cohort to help her.", "vote_average": 7.958, "runtime": 132, "poster_path": "https://image.tmdb.org/t/p/w500/2ti3l1OeB8G94yyqfAI7nmMZUbA.jpg", "cast": "Clint Eastwood, Hilary Swank, Morgan Freeman, Jay Baruchel, Mike Colter", "director": "Clint Eastwood", "release_date": "2004-12-15"}, {"id": 314365, "title": "Spotlight", "overview": "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core.", "vote_average": 7.814, "runtime": 129, "poster_path": "https://image.tmdb.org/t/p/w500/gWkgMnIsd8Od7iyhEEKL5G4Qq6J.jpg", "cast": "Mark Ruffalo, Michael Keaton, Rachel McAdams, Liev Schreiber, John Slattery", "director": "Tom McCarthy", "release_date": "2015-11-06"}, {"id": 406997, "title": "Wonder", "overview": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.", "vote_average": 8.155, "runtime": 113, "poster_path": "https://image.tmdb.org/t/p/w500/ouYgAatYH4JzIThj6FI3UYf31RI.jpg", "cast": "Jacob Tremblay, Julia Roberts, Owen Wilson, Izabela Vidovic, Noah Jupe", "director": "Stephen Chbosky", "release_date": "2017-11-13"}, {"id": 264644, "title": "Room", "overview": "Held captive for 7 years in an enclosed space, a woman and her young son finally gain their freedom, allowing the boy to experience the outside world for the first time.", "vote_average": 8.033, "runtime": 118, "poster_path": "https://image.tmdb.org/t/p/w500/dIxoYFcj6EqD5KScuU8lWCftnvH.jpg", "cast": "Brie Larson, Jacob Tremblay, Joan Allen, Sean Bridgers, Tom McCamus", "director": "Lenny Abrahamson", "release_date": "2015-10-16"}, {"id": 87827, "title": "Life of Pi", "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.", "vote_average": 7.398, "runtime": 127, "poster_path": "https://image.tmdb.org/t/p/w500/iLgRu4hhSr6V1uManX6ukDriiSc.jpg", "cast": "Suraj Sharma, Irrfan Khan, Ayush Tandon, Gautam Belur, Adil Hussain", "director": "Ang Lee", "release_date": "2012-11-20"}, {"id": 5915, "title": "Into the Wild", "overview": "After graduating from Emory University in 1992, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity, and hitchhikes to Alaska to live in the wilderness.", "vote_average": 7.81, "runtime": 148, "poster_path": "https://image.tmdb.org/t/p/w500/2MSGZEE6XZd2r4ODNziwAw7Hpw0.jpg", "cast": "Emile Hirsch, Marcia Gay Harden, William Hurt, Jena Malone, Brian H. Dierker", "director": "Sean Penn", "release_date": "2007-09-11"}, {"id": 334533, "title": "Captain Fantastic", "overview": "A father living in the forests of the Pacific Northwest with his six young kids tries to assimilate back into society.", "vote_average": 7.912, "runtime": 118, "poster_path": "https://image.tmdb.org/t/p/w500/2sFME73GaD8UsUxPUKe60cPdLif.jpg", "cast": "Viggo Mortensen, George MacKay, Samantha Isler, Annalise Basso, Nicholas Hamilton", "director": "Matt Ross", "release_date": "2016-07-08"}, {"id": 527641, "title": "Five Feet Apart", "overview": "Seventeen-year-old Stella spends most of her time in the hospital as a cystic fibrosis patient. Her life is full of routines, boundaries and self-control — all of which get put to the test when she meets Will, an impossibly charming teen who has the same illness. There's an instant flirtation, though restrictions dictate that they must maintain a safe distance between them. As their connection intensifies, so does the temptation to throw the rules out the window and embrace that attraction.", "vote_average": 8.287, "runtime": 116, "poster_path": "https://image.tmdb.org/t/p/w500/kreTuJBkUjVWePRfhHZuYfhNE1T.jpg", "cast": "Haley Lu Richardson, Cole Sprouse, Moisés Arias, Kimberly Hébert Gregory, Parminder Nagra", "director": "Justin Baldoni", "release_date": "2019-03-14"}, {"id": 296096, "title": "Me Before You", "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.", "vote_average": 7.918, "runtime": 110, "poster_path": "https://image.tmdb.org/t/p/w500/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg", "cast": "Emilia Clarke, Sam Claflin, Janet McTeer, Charles Dance, Brendan Coyle", "director": "Thea Sharrock", "release_date": "2016-06-01"}, {"id": 13885, "title": "Sweeney Todd: The Demon Barber of Fleet Street", "overview": "The infamous story of Benjamin Barker, a.k.a Sweeney Todd, who sets up a barber shop down in London which is the basis for a sinister partnership with his fellow tenant, Mrs. Lovett. Based on the hit Broadway musical.", "vote_average": 7.2, "runtime": 116, "poster_path": "https://image.tmdb.org/t/p/w500/gAW4J1bkRjZKmFsJsIiOBASeoAp.jpg", "cast": "Johnny Depp, Helena Bonham Carter, Alan Rickman, Timothy Spall, Sacha Baron Cohen", "director": "Tim Burton", "release_date": "2007-12-20"}, {"id": 537915, "title": "After", "overview": "Tessa Young is a dedicated student, dutiful daughter and loyal girlfriend to her high school sweetheart. Entering her first semester of college, Tessa's guarded world opens up when she meets Hardin Scott, a mysterious and brooding rebel who makes her question all she thought she knew about herself -- and what she wants out of life.", "vote_average": 7.137, "runtime": 106, "poster_path": "https://image.tmdb.org/t/p/w500/u3B2YKUjWABcxXZ6Nm9h10hLUbh.jpg", "cast": "Josephine Langford, Hero Fiennes Tiffin, Shane Paul McGhie, Khadijha Red Thunder, Dylan Arnold", "director": "Jenny Gage", "release_date": "2019-04-11"}, {"id": 613504, "title": "After We Collided", "overview": "Tessa finds herself struggling with her complicated relationship with Hardin; she faces a dilemma that could change their lives forever.", "vote_average": 7.202, "runtime": 105, "poster_path": "https://image.tmdb.org/t/p/w500/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg", "cast": "Josephine Langford, Hero Fiennes Tiffin, Dylan Sprouse, Louise Lombard, Charlie Weber", "director": "Roger Kumble", "release_date": "2020-09-02"}, {"id": 345920, "title": "Collateral Beauty", "overview": "Retreating from life after a tragedy, a man questions the universe by writing to Love, Time and Death. Receiving unexpected answers, he begins to see how these things interlock and how even loss can reveal moments of meaning and beauty.", "vote_average": 7.239, "runtime": 97, "poster_path": "https://image.tmdb.org/t/p/w500/pVIAPiIvHcitgXV8BA7uTyCcEuk.jpg", "cast": "Will Smith, Edward Norton, Kate Winslet, Michael Peña, Helen Mirren", "director": "David Frankel", "release_date": "2016-12-15"}, {"id": 340666, "title": "Nocturnal Animals", "overview": "Susan Morrow receives a book manuscript from her ex-husband – a man she left 20 years earlier – asking for her opinion of his writing. As she reads, she is drawn into the fictional life of Tony Hastings, a mathematics professor whose family vacation turns violent.", "vote_average": 7.442, "runtime": 117, "poster_path": "https://image.tmdb.org/t/p/w500/mdLDgQBD0va09npSQX5Zgo2evXM.jpg", "cast": "Amy Adams, Jake Gyllenhaal, Michael Shannon, Aaron Taylor-Johnson, Isla Fisher", "director": "Tom Ford", "release_date": "2016-11-04"}, {"id": 419704, "title": "Ad Astra", "overview": "The near future, a time when both hope and hardships drive humanity to look to the stars and beyond. While a mysterious phenomenon menaces to destroy life on planet Earth, astronaut Roy McBride undertakes a mission across the immensity of space and its many perils to uncover the truth about a lost expedition that decades before boldly faced emptiness and silence in search of the unknown.", "vote_average": 6.1, "runtime": 123, "poster_path": "https://image.tmdb.org/t/p/w500/xBHvZcjRiWyobQ9kxBhO6B2dtRI.jpg", "cast": "Brad Pitt, Tommy Lee Jones, Liv Tyler, Ruth Negga, Donald Sutherland", "director": "James Gray", "release_date": "2019-09-17"}, {"id": 337167, "title": "Fifty Shades Freed", "overview": "Believing they have left behind shadowy figures from their past, newlyweds Christian and Ana fully embrace an inextricable connection and shared life of luxury. But just as she steps into her role as Mrs. Grey and he relaxes into an unfamiliar stability, new threats could jeopardize their happy ending before it even begins.", "vote_average": 6.705, "runtime": 105, "poster_path": "https://image.tmdb.org/t/p/w500/9ZedQHPQVveaIYmDSTazhT3y273.jpg", "cast": "Dakota Johnson, Jamie Dornan, Eric Johnson, Eloise Mumford, Rita Ora", "director": "James Foley", "release_date": "2018-01-17"}]}